## NA handling methods

## Axis Change

In [4]:
import pandas as pd
import numpy as np

In [5]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                     index=['Ohio', 'Colorado', 'New York'],
                     columns=['one', 'two', 'three', 'four'])

In [6]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [7]:
transform = lambda x: x[:4].upper()

In [8]:
data.index.map(transform)

array(['OHIO', 'COLO', 'NEW '], dtype=object)

In [10]:
data.index = data.index.map(transform)

In [11]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11